Enterprise_Serivces/Prod/Bronze4/CSLRealmUserService/result1/Iteration1/t2_RequestBody.txt

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing"><soap:Header><wsa:Action>http://www.gamestop.com/services/csl/realmuser/contracts/2010/05/IRealmUserService/GetRealmUsersByCustomerID</wsa:Action><wsa:MessageID>uuid:41d30828-d4a1-4cc9-999f-54758083c920</wsa:MessageID><wsa:ReplyTo><wsa:Address>http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsa:To>http://cslrealmuserserviceqa1.testgs.pvt/RealmUserService.svc</wsa:To></soap:Header><soap:Body><GetRealmUsersByCustomerID xmlns="http://www.gamestop.com/services/csl/realmuser/contracts/2010/05"><request><MachineName xmlns="http://www.gamestop.com/services/core/contracts/2010/05">test</MachineName><CustomerID xmlns="http://www.gamestop.com/services/csl/RealmUser/contracts/messages/2011/05">2150431</CustomerID></request></GetRealmUsersByCustomerID></soap:Body></soap:Envelope>